app/controllers/users_controller.rb

  def show
    @user = User.find_by(:username => params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mayutti"], ["LIMIT", 1]]